cost = int(input("Введіть вартість однієї приставки - "))
kolvo = int(input("Введіть кількість приставок - "))
dis = int(input("Введіть знижку в % - "))
ver = int(input(' 1 всі приставки \n 2 одна приставка \n'))
if ver == 1:
    r = cost*kolvo
    f = r/100*dis
    f_1 = r-f
    p = 'всі приставки'
    y = p
    print("Вартість всіх приставок з знижкою", f_1)
elif ver == 2:
    r = cost/100*dis
    o = cost - r
    k = 'одна приставка'
    y = k
    print("Вартість однієї приставки з знижкою", o)
